app/Controllers/Admin.php

SELECT *
FROM `fasilitas`
---
    public function hal_fasilitas()
    {
        $data =
        [
            'page' => "hal_fasilitas",
            'nama' => "Administrator",
            'level' => "admin"
        ];
        $data['fac'] = $this->AdminFasilitas->findAll();

SELECT *
FROM `reservasi`
---
    public function reservasi()
    {
        $data =
        [
            'page' => "reservasi",
            'nama' => "Administrator",
            'level' => "admin"
        ];
        $data['fac'] = $this->AdminReservasi->findAll();

SELECT *
FROM `user`
---
    public function user()
    {
        $data =
        [
            'page' => "hal_user",
            'nama' => "Administrator",
            'level' => "admin"
        ];
        $data['fac'] = $this->AdminUser->findAll();