app/Controllers/Lab.php

SELECT *
FROM `lab`
WHERE `id_lab` = 1
 LIMIT 1
---
    public function rpl()
    {
        $data['page'] = 'lab';
        $data['level'] = "user";
        $data['hasil'] = $this->model_lab->where(['id_lab' => 1])->first();

SELECT *
FROM `fasilitas`
WHERE `ruangan` = 'tkj'
---
    public function fac_tkj()
    {
        $data =
            [
                'level' =>  "user",
                'page' => 'fasilitas',
                'item' => $this->fasilitasModel->where('ruangan', 'tkj')->find()

SELECT *
FROM `fasilitas`
WHERE `ruangan` = 'rpl'
---
    public function fac_rpl()
    {
        $data =
            [
                'level' =>  "user",
                'page' => 'fasilitas',
                'item' => $this->fasilitasModel->where('ruangan', 'rpl')->find()