app/Models/AdminLab.php

UPDATE `lab` SET `id_lab` = '2', `isi` = 'Laboratorium Rekayasa Perangkat Lunak merupakan salah satu laboratorium yang ada di Program Studi Pendidikan Teknik Informatika dan Komputer. Laboratorium Rekayasa Perangkat Lunak mengakomodasi kegiatan-kegiatan yang menyangkut perancangan dan rekayasa software (perangkat lunak) di bidang Teknologi Informasi. Untuk kegiatan internal, laboratorium ini rutin digunakan untuk kegiatan praktikum mata kuliah yang berkaitan dengan perangkat lunak. Selain itu, mahasiswa bisa memanfaatkan laboratorium ini untuk menunjang berbagai pengerjaan tugas besar, praktek kerja lapangan, proyek kelompok, tugas akhir mahasiswa. Untuk dosen, Laboratorium Rekayasa Perangkat Lunak dapat memfasilitasi berbagai kegiatan yang berkaitan dengan penelitian dan pengabdian kepada masyarakat.'
WHERE `id` = '1'
---
    public function updateLab($data, $id)
    {
        $query = $this->db->table('lab')->update($data, array('id' => $id));