app/Models/AdminUser.php

    public function updateUser($data, $id)
    {
        $query = $this->db->table('user')->update($data, array('id_user' => $id));
---
UPDATE `user` SET `level` = '1', `email` = 'krisna@student.uns.ac.id', `nama` = 'Krisna Mukti', `username` = 'krisna', `alamat` = 'Pabelan', `password` = 'anjaymabar'
WHERE `id_user` = '2'